In [1]:
import pandas as pd

# Read CSV file from GitHub (using raw content URL)
df = pd.read_csv('https://raw.githubusercontent.com/yesdhruv/gapminder.csv/master/gapminder_data_graphs.csv')

# Display the first few rows of the dataframe
print(df.head())

       country continent  year  life_exp  hdi_index  co2_consump    gdp  \
0  Afghanistan      Asia  1998      53.3      0.344       0.0522    NaN
1  Afghanistan      Asia  1999      54.7      0.348       0.0402    NaN
2  Afghanistan      Asia  2000      54.7      0.350       0.0370    NaN
3  Afghanistan      Asia  2001      54.8      0.353       0.0376    NaN
4  Afghanistan      Asia  2002      55.5      0.384       0.0471  333.0

   services
0      24.4
1      24.6
2      24.7
3      24.7
4      25.6

In [2]:
# Pandas for handling hetrogeneous data instead numpy ony handle one type of data

In [3]:
df.head()

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
0,Afghanistan,Asia,1998,53.3,0.344,0.0522,NaN,24.4
1,Afghanistan,Asia,1999,54.7,0.348,0.0402,NaN,24.6
2,Afghanistan,Asia,2000,54.7,0.350,0.0370,NaN,24.7
3,Afghanistan,Asia,2001,54.8,0.353,0.0376,NaN,24.7
4,Afghanistan,Asia,2002,55.5,0.384,0.0471,333.0,25.6

In [4]:
df.shape

(3675, 8)

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3675 entries, 0 to 3674
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   country      3675 non-null   object
 1   continent    3675 non-null   object
 2   year         3675 non-null   int64
 3   life_exp     3675 non-null   float64
 4   hdi_index    3563 non-null   float64
 5   co2_consump  3671 non-null   float64
 6   gdp          3633 non-null   float64
 7   services     3675 non-null   float64
dtypes: float64(5), int64(1), object(2)
memory usage: 229.8+ KB

In [7]:
df.describe()

,year,life_exp,hdi_index,co2_consump,gdp,services
count,3675.000000,3675.000000,3563.000000,3671.000000,3633.000000,3675.000000
mean,2008.000000,69.849306,0.674864,4.712731,11966.053675,51.248705
std,6.056125,8.886563,0.164834,6.567435,17105.787953,18.312501
min,1998.000000,32.500000,0.255000,0.015900,238.000000,5.590000
25%,2003.000000,63.900000,0.537500,0.560500,1470.000000,37.600000
50%,2008.000000,71.700000,0.699000,2.250000,4280.000000,52.900000
75%,2013.000000,76.400000,0.805000,6.615000,13600.000000,65.700000
max,2018.000000,84.800000,0.956000,67.100000,105000.000000,88.500000

In [8]:
df.columns

Index(['country', 'continent', 'year', 'life_exp', 'hdi_index', 'co2_consump',
       'gdp', 'services'],
      dtype='object')

In [9]:
list(df.keys())

['country',
 'continent',
 'year',
 'life_exp',
 'hdi_index',
 'co2_consump',
 'gdp',
 'services']

In [10]:
df["country"].head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [11]:
df_country_continient=df[["country", "continent"]].sample(10)

In [12]:
df_country_continient

            country      continent
838   Cote d'Ivoire         Africa
446          Brazil  South America
1974     Madagascar         Africa
3422   Turkmenistan           Asia
122         Armenia           Asia
681           Chile  South America
1158        Finland         Europe
162         Austria         Europe
2883   Sierra Leone         Africa
902          Cyprus           Asia

In [13]:
df.drop("continent", axis=1)

          country  year  life_exp  hdi_index  co2_consump     gdp  services
0     Afghanistan  1998      53.3      0.344       0.0522     NaN      24.4
1     Afghanistan  1999      54.7      0.348       0.0402     NaN      24.6
2     Afghanistan  2000      54.7      0.350       0.0370     NaN      24.7
3     Afghanistan  2001      54.8      0.353       0.0376     NaN      24.7
4     Afghanistan  2002      55.5      0.384       0.0471   333.0      25.6
...           ...   ...       ...        ...          ...     ...       ...
3670     Zimbabwe  2014      58.0      0.547       0.8810  1440.0      25.4
3671     Zimbabwe  2015      58.6      0.553       0.8810  1450.0      25.7
3672     Zimbabwe  2016      59.2      0.558       0.7710  1430.0      26.1
3673     Zimbabwe  2017      59.9      0.563       0.8450  1480.0      26.6
3674     Zimbabwe  2018      60.6      0.569       0.8500  1510.0      27.2

[3675 rows x 7 columns]

In [14]:
df.head()

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
0,Afghanistan,Asia,1998,53.3,0.344,0.0522,NaN,24.4
1,Afghanistan,Asia,1999,54.7,0.348,0.0402,NaN,24.6
2,Afghanistan,Asia,2000,54.7,0.350,0.0370,NaN,24.7
3,Afghanistan,Asia,2001,54.8,0.353,0.0376,NaN,24.7
4,Afghanistan,Asia,2002,55.5,0.384,0.0471,333.0,25.6

In [15]:
df_minus_continent = df.drop("continent", axis=1)

In [16]:
df_minus_continent

          country  year  life_exp  hdi_index  co2_consump     gdp  services
0     Afghanistan  1998      53.3      0.344       0.0522     NaN      24.4
1     Afghanistan  1999      54.7      0.348       0.0402     NaN      24.6
2     Afghanistan  2000      54.7      0.350       0.0370     NaN      24.7
3     Afghanistan  2001      54.8      0.353       0.0376     NaN      24.7
4     Afghanistan  2002      55.5      0.384       0.0471   333.0      25.6
...           ...   ...       ...        ...          ...     ...       ...
3670     Zimbabwe  2014      58.0      0.547       0.8810  1440.0      25.4
3671     Zimbabwe  2015      58.6      0.553       0.8810  1450.0      25.7
3672     Zimbabwe  2016      59.2      0.558       0.7710  1430.0      26.1
3673     Zimbabwe  2017      59.9      0.563       0.8450  1480.0      26.6
3674     Zimbabwe  2018      60.6      0.569       0.8500  1510.0      27.2

[3675 rows x 7 columns]

In [17]:
df.drop("continent", axis=1, inplace=True)

In [18]:
df.head()

       country  year  life_exp  hdi_index  co2_consump    gdp  services
0  Afghanistan  1998      53.3      0.344       0.0522    NaN      24.4
1  Afghanistan  1999      54.7      0.348       0.0402    NaN      24.6
2  Afghanistan  2000      54.7      0.350       0.0370    NaN      24.7
3  Afghanistan  2001      54.8      0.353       0.0376    NaN      24.7
4  Afghanistan  2002      55.5      0.384       0.0471  333.0      25.6

In [19]:
df = pd.read_csv('https://raw.githubusercontent.com/yesdhruv/gapminder.csv/master/gapminder_data_graphs.csv')

# Display the first few rows of the dataframe
print(df.head())

       country continent  year  life_exp  hdi_index  co2_consump    gdp  \
0  Afghanistan      Asia  1998      53.3      0.344       0.0522    NaN
1  Afghanistan      Asia  1999      54.7      0.348       0.0402    NaN
2  Afghanistan      Asia  2000      54.7      0.350       0.0370    NaN
3  Afghanistan      Asia  2001      54.8      0.353       0.0376    NaN
4  Afghanistan      Asia  2002      55.5      0.384       0.0471  333.0

   services
0      24.4
1      24.6
2      24.7
3      24.7
4      25.6

In [ ]:
# row
# 1. loc : Label index
# 2. iloc : index (positional value)

In [20]:
df.loc[3]

country        Afghanistan
continent             Asia
year                  2001
life_exp              54.8
hdi_index            0.353
co2_consump         0.0376
gdp                    NaN
services              24.7
Name: 3, dtype: object

In [21]:
df.iloc[3]

country        Afghanistan
continent             Asia
year                  2001
life_exp              54.8
hdi_index            0.353
co2_consump         0.0376
gdp                    NaN
services              24.7
Name: 3, dtype: object

In [23]:
df.iloc[[1,10,100]]

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
1,Afghanistan,Asia,1999,54.7,0.348,0.0402,NaN,24.6
10,Afghanistan,Asia,2008,59.2,0.447,0.1520,415.0,28.2
100,Argentina,South America,2014,76.5,0.836,4.5600,13600.0,75.3

In [24]:
df.loc[[1,10,100]]

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
1,Afghanistan,Asia,1999,54.7,0.348,0.0402,NaN,24.6
10,Afghanistan,Asia,2008,59.2,0.447,0.1520,415.0,28.2
100,Argentina,South America,2014,76.5,0.836,4.5600,13600.0,75.3

In [27]:
# df.loc[-1] # -1 is not a label

In [26]:
df.iloc[-1]

country        Zimbabwe
continent        Africa
year               2018
life_exp           60.6
hdi_index         0.569
co2_consump        0.85
gdp              1510.0
services           27.2
Name: 3674, dtype: object

In [28]:
df.iloc[1:5, 1:4]

  continent  year  life_exp
1      Asia  1999      54.7
2      Asia  2000      54.7
3      Asia  2001      54.8
4      Asia  2002      55.5

In [30]:
df.loc["1":"5", df.columns[1:4]]

     continent  year  life_exp
1         Asia  1999      54.7
2         Asia  2000      54.7
3         Asia  2001      54.8
4         Asia  2002      55.5
5         Asia  2003      56.5
...        ...   ...       ...
3670    Africa  2014      58.0
3671    Africa  2015      58.6
3672    Africa  2016      59.2
3673    Africa  2017      59.9
3674    Africa  2018      60.6

[3674 rows x 3 columns]

In [31]:
df.drop(3, axis=0, inplace=True)

In [33]:
df.head(10)

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
0,Afghanistan,Asia,1998,53.3,0.344,0.0522,NaN,24.4
1,Afghanistan,Asia,1999,54.7,0.348,0.0402,NaN,24.6
2,Afghanistan,Asia,2000,54.7,0.350,0.0370,NaN,24.7
4,Afghanistan,Asia,2002,55.5,0.384,0.0471,333.0,25.6
5,Afghanistan,Asia,2003,56.5,0.393,0.0509,346.0,25.9
6,Afghanistan,Asia,2004,57.1,0.409,0.0368,336.0,26.1
7,Afghanistan,Asia,2005,57.6,0.418,0.0515,360.0,26.5
8,Afghanistan,Asia,2006,58.0,0.429,0.0622,368.0,26.9
9,Afghanistan,Asia,2007,58.5,0.447,0.0838,409.0,27.7
10,Afghanistan,Asia,2008,59.2,0.447,0.1520,415.0,28.2

In [34]:
df.iloc[3]

country        Afghanistan
continent             Asia
year                  2002
life_exp              55.5
hdi_index            0.384
co2_consump         0.0471
gdp                  333.0
services              25.6
Name: 4, dtype: object

In [37]:
# df.loc[3] #gvie error

In [38]:
df.index[3]

np.int64(4)

In [39]:
c=df["country"]

In [40]:
type(c)

pandas.core.series.Series

In [41]:
#fetching / quering data using

In [42]:
df.life_exp # accesing attributes #not recommended

0       53.3
1       54.7
2       54.7
4       55.5
5       56.5
        ...
3670    58.0
3671    58.6
3672    59.2
3673    59.9
3674    60.6
Name: life_exp, Length: 3674, dtype: float64

In [ ]:
# Filter rows where life_exp > 60

In [43]:
df.loc[df["life_exp"] > 60] # deleting rows

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
12,Afghanistan,Asia,2010,60.5,0.472,0.290,547.0,30.7
13,Afghanistan,Asia,2011,61.0,0.477,0.406,533.0,31.7
14,Afghanistan,Asia,2012,61.4,0.489,0.345,580.0,32.8
15,Afghanistan,Asia,2013,61.9,0.496,0.280,592.0,33.8
16,Afghanistan,Asia,2014,61.9,0.500,0.253,588.0,34.8
...,...,...,...,...,...,...,...,...
3650,Zambia,Africa,2015,60.8,0.569,0.271,1340.0,37.1
3651,Zambia,Africa,2016,61.4,0.571,0.296,1350.0,38.0
3652,Zambia,Africa,2017,61.9,0.578,0.304,1350.0,38.6
3653,Zambia,Africa,2018,62.5,0.582,0.302,1370.0,39.3
3674,Zimbabwe,Africa,2018,60.6,0.569,0.850,1510.0,27.2

In [46]:
df.loc[df["life_exp"] > 60, ["country", "continent"]].head()

        country continent
12  Afghanistan      Asia
13  Afghanistan      Asia
14  Afghanistan      Asia
15  Afghanistan      Asia
16  Afghanistan      Asia

In [47]:
df[df["year"] > 2000]

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
4,Afghanistan,Asia,2002,55.5,0.384,0.0471,333.0,25.6
5,Afghanistan,Asia,2003,56.5,0.393,0.0509,346.0,25.9
6,Afghanistan,Asia,2004,57.1,0.409,0.0368,336.0,26.1
7,Afghanistan,Asia,2005,57.6,0.418,0.0515,360.0,26.5
8,Afghanistan,Asia,2006,58.0,0.429,0.0622,368.0,26.9
...,...,...,...,...,...,...,...,...
3670,Zimbabwe,Africa,2014,58.0,0.547,0.8810,1440.0,25.4
3671,Zimbabwe,Africa,2015,58.6,0.553,0.8810,1450.0,25.7
3672,Zimbabwe,Africa,2016,59.2,0.558,0.7710,1430.0,26.1
3673,Zimbabwe,Africa,2017,59.9,0.563,0.8450,1480.0,26.6
3674,Zimbabwe,Africa,2018,60.6,0.569,0.8500,1510.0,27.2

In [50]:
df[(df["life_exp"] > 55) & (df["hdi_index"] > 0.35)]

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
4,Afghanistan,Asia,2002,55.5,0.384,0.0471,333.0,25.6
5,Afghanistan,Asia,2003,56.5,0.393,0.0509,346.0,25.9
6,Afghanistan,Asia,2004,57.1,0.409,0.0368,336.0,26.1
7,Afghanistan,Asia,2005,57.6,0.418,0.0515,360.0,26.5
8,Afghanistan,Asia,2006,58.0,0.429,0.0622,368.0,26.9
...,...,...,...,...,...,...,...,...
3670,Zimbabwe,Africa,2014,58.0,0.547,0.8810,1440.0,25.4
3671,Zimbabwe,Africa,2015,58.6,0.553,0.8810,1450.0,25.7
3672,Zimbabwe,Africa,2016,59.2,0.558,0.7710,1430.0,26.1
3673,Zimbabwe,Africa,2017,59.9,0.563,0.8450,1480.0,26.6
3674,Zimbabwe,Africa,2018,60.6,0.569,0.8500,1510.0,27.2

In [51]:
df.query("continent == 'Asia' and co2_consump < 0.05")

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
1,Afghanistan,Asia,1999,54.7,0.348,0.0402,NaN,24.6
2,Afghanistan,Asia,2000,54.7,0.350,0.0370,NaN,24.7
4,Afghanistan,Asia,2002,55.5,0.384,0.0471,333.0,25.6
6,Afghanistan,Asia,2004,57.1,0.409,0.0368,336.0,26.1

In [52]:
filtered_string = df.loc[df["country"].str.contains("stan", case=False, na=False), :]
filtered_string.head()

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
0,Afghanistan,Asia,1998,53.3,0.344,0.0522,NaN,24.4
1,Afghanistan,Asia,1999,54.7,0.348,0.0402,NaN,24.6
2,Afghanistan,Asia,2000,54.7,0.350,0.0370,NaN,24.7
4,Afghanistan,Asia,2002,55.5,0.384,0.0471,333.0,25.6
5,Afghanistan,Asia,2003,56.5,0.393,0.0509,346.0,25.9

In [53]:
specific_years = df.loc[df["year"].isin([1998, 1999, 2000]), :]
specific_years.head()

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
0,Afghanistan,Asia,1998,53.3,0.344,0.0522,NaN,24.4
1,Afghanistan,Asia,1999,54.7,0.348,0.0402,NaN,24.6
2,Afghanistan,Asia,2000,54.7,0.350,0.0370,NaN,24.7
21,Albania,Europe,1998,74.8,0.655,0.5630,1600.0,33.0
22,Albania,Europe,1999,75.1,0.665,0.9560,1820.0,33.8

In [54]:
# Option 1: Using .loc to select rows with missing 'gdp'
missing_gdp = df.loc[df["gdp"].isna(), :]
missing_gdp.head()

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
0,Afghanistan,Asia,1998,53.3,0.344,0.0522,NaN,24.4
1,Afghanistan,Asia,1999,54.7,0.348,0.0402,NaN,24.6
2,Afghanistan,Asia,2000,54.7,0.350,0.0370,NaN,24.7
945,Djibouti,Africa,1998,60.2,0.355,0.5010,NaN,44.7
946,Djibouti,Africa,1999,60.3,0.359,0.4870,NaN,45.3

In [55]:
# Option 2: Drop rows with missing 'gdp' and then select all columns
df_without_missing_gdp = df.dropna(subset=["gdp"])
df_without_missing_gdp = df_without_missing_gdp.loc[:, :]
df_without_missing_gdp.head()

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
4,Afghanistan,Asia,2002,55.5,0.384,0.0471,333.0,25.6
5,Afghanistan,Asia,2003,56.5,0.393,0.0509,346.0,25.9
6,Afghanistan,Asia,2004,57.1,0.409,0.0368,336.0,26.1
7,Afghanistan,Asia,2005,57.6,0.418,0.0515,360.0,26.5
8,Afghanistan,Asia,2006,58.0,0.429,0.0622,368.0,26.9

In [56]:
# Group by country and calculate mean life_exp
country_life_exp = df.groupby("country")["life_exp"].mean().reset_index()

# Filter countries with average life_exp > 55 using .loc
high_life_exp_countries = country_life_exp.loc[country_life_exp["life_exp"] > 55, :]
high_life_exp_countries.head()

       country   life_exp
0  Afghanistan  59.060000
1      Albania  77.080952
2      Algeria  73.571429
3       Angola  58.438095
4    Argentina  75.404762

In [57]:
# Filter for rows where continent is 'Asia'
asia_df = df.loc[df["continent"] == "Asia", :]

# Group by year and calculate mean co2_consump
mean_co2_by_year = asia_df.groupby("year")["co2_consump"].mean().reset_index()

# Filter years where the mean co2_consump is below 0.05 using .loc
low_co2_years = mean_co2_by_year.loc[mean_co2_by_year["co2_consump"] < 0.05, :]
low_co2_years.head()

Empty DataFrame
Columns: [year, co2_consump]
Index: []

In [58]:
def dynamic_filter(df, min_life_exp, max_co2, years):
    # Create a boolean mask for each condition
    mask = (
        (df["life_exp"] >= min_life_exp) &
        (df["co2_consump"] <= max_co2) &
        (df["year"].isin(years))
    )
    # Use .loc to return rows that satisfy the mask
    return df.loc[mask, :]

# Example usage:
result = dynamic_filter(df, min_life_exp=55, max_co2=0.05, years=[1998, 1999, 2000])
result.head()

Empty DataFrame
Columns: [country, continent, year, life_exp, hdi_index, co2_consump, gdp, services]
Index: []

In [59]:
import numpy as np

# Create a new column that categorizes life expectancy as 'High' or 'Low'
df["life_exp_category"] = np.where(df["life_exp"] > 55, "High", "Low")

# Filter rows where the life expectancy category is 'High', the continent is 'Asia',
# and where GDP is not missing (gdp not NaN)
advanced_filter = df.loc[
    (df["life_exp_category"] == "High") & 
    (df["continent"] == "Asia") & 
    (~df["gdp"].isna()),
    :
]
advanced_filter.head()

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services,life_exp_category
4,Afghanistan,Asia,2002,55.5,0.384,0.0471,333.0,25.6,High
5,Afghanistan,Asia,2003,56.5,0.393,0.0509,346.0,25.9,High
6,Afghanistan,Asia,2004,57.1,0.409,0.0368,336.0,26.1,High
7,Afghanistan,Asia,2005,57.6,0.418,0.0515,360.0,26.5,High
8,Afghanistan,Asia,2006,58.0,0.429,0.0622,368.0,26.9,High

In [60]:
# Define a local variable for the minimum HDI value
min_hdi = 0.35

# Use query to filter rows where hdi_index is greater than min_hdi and co2_consump is less than 0.05
advanced_query = df.query("hdi_index > @min_hdi and co2_consump < 0.05")
advanced_query.head()

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services,life_exp_category
4,Afghanistan,Asia,2002,55.5,0.384,0.0471,333.0,25.60,High
6,Afghanistan,Asia,2004,57.1,0.409,0.0368,336.0,26.10,High
533,Burundi,Africa,2006,54.5,0.359,0.0246,302.0,7.48,Low
534,Burundi,Africa,2007,55.7,0.371,0.0238,302.0,7.76,High
535,Burundi,Africa,2008,56.8,0.384,0.0235,307.0,8.09,High

In [ ]:
# Filter groups (countries) with average life_exp greater than 55 and at least 3 records
countries_filtered = df.groupby("country").filter(
    lambda group: (group["life_exp"].mean() > 55) and (len(group) >= 3)
)
countries_filtered.head()

In [61]:
# Calculate the average services value for each continent and year
services_mean = df.groupby(["continent", "year"])["services"].mean().reset_index()

# Filter to show only those rows where the average services value is above 25
advanced_services_filter = services_mean.loc[services_mean["services"] > 25, :]
advanced_services_filter.head()

  continent  year   services
0    Africa  1998  32.297059
1    Africa  1999  32.681176
2    Africa  2000  32.981765
3    Africa  2001  33.340000
4    Africa  2002  33.694118

In [64]:
df.groupby("year")[["life_exp", "gdp"]].mean().reset_index()

    year   life_exp           gdp
0   1998  66.912000   9950.796407
1   1999  67.125714  10160.803571
2   2000  67.410286  10701.479532
3   2001  67.750000  10753.308140
4   2002  67.873714  10834.317919
5   2003  68.094286  11042.456647
6   2004  68.371429  11443.462428
7   2005  68.735429  11710.924855
8   2006  69.122857  12127.121387
9   2007  69.516571  12504.092486
10  2008  69.850286  12478.000000
11  2009  70.217714  11968.045977
12  2010  70.473143  12212.982759
13  2011  70.967429  12399.620690
14  2012  71.312571  12476.586207
15  2013  71.607429  12521.057143
16  2014  71.804000  12690.285714
17  2015  72.045143  12919.028571
18  2016  72.324000  13164.609195
19  2017  72.584571  13396.195402
20  2018  72.810857  13627.793103

In [65]:
df_sorted = df.sort_values(["country", "year"])

In [66]:
df_sorted

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services,life_exp_category
0,Afghanistan,Asia,1998,53.3,0.344,0.0522,NaN,24.4,Low
1,Afghanistan,Asia,1999,54.7,0.348,0.0402,NaN,24.6,Low
2,Afghanistan,Asia,2000,54.7,0.350,0.0370,NaN,24.7,Low
4,Afghanistan,Asia,2002,55.5,0.384,0.0471,333.0,25.6,High
5,Afghanistan,Asia,2003,56.5,0.393,0.0509,346.0,25.9,High
...,...,...,...,...,...,...,...,...,...
3670,Zimbabwe,Africa,2014,58.0,0.547,0.8810,1440.0,25.4,High
3671,Zimbabwe,Africa,2015,58.6,0.553,0.8810,1450.0,25.7,High
3672,Zimbabwe,Africa,2016,59.2,0.558,0.7710,1430.0,26.1,High
3673,Zimbabwe,Africa,2017,59.9,0.563,0.8450,1480.0,26.6,High
3674,Zimbabwe,Africa,2018,60.6,0.569,0.8500,1510.0,27.2,High

In [67]:
# Sort DataFrame by country and year to compute year-to-year differences
df_sorted = df.sort_values(["country", "year"])

# Compute the difference in life expectancy for each country between consecutive years
df_sorted["life_exp_change"] = df_sorted.groupby("country")["life_exp"].diff()

# Filter rows where the absolute change in life expectancy is greater than 2
advanced_life_exp_change = df_sorted.loc[df_sorted["life_exp_change"].abs() > 2, :]
advanced_life_exp_change.head()

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services,life_exp_category,life_exp_change
427,Botswana,Africa,2005,49.9,0.601,2.2800,5080.0,56.60,Low,2.4
533,Burundi,Africa,2006,54.5,0.359,0.0246,302.0,7.48,Low,4.2
647,Central African Republic,Africa,2015,49.7,0.375,0.0653,377.0,21.60,Low,2.2
1093,Eswatini,Africa,1999,50.7,0.479,1.2500,2460.0,50.40,Low,-2.3
1094,Eswatini,Africa,2000,48.3,0.465,1.1900,2470.0,50.90,Low,-2.4

In [70]:
# Set a MultiIndex on the DataFrame
df_multi = df.set_index(["country", "year"])

# Filter rows for a specific country (e.g., 'Afghanistan') and years greater than 2000
advanced_multi_filter = df_multi.loc[
    ("Afghanistan", slice(2001, None)),  # slice for years > 2000
]
advanced_multi_filter.head()

# To filter further (e.g., life_exp greater than 55), you can do:
advanced_multi_filter = advanced_multi_filter.loc[advanced_multi_filter["life_exp"] > 55, :]
advanced_multi_filter.head()

                 continent  life_exp  hdi_index  co2_consump    gdp  services  \
country     year
Afghanistan 2002      Asia      55.5      0.384       0.0471  333.0      25.6
            2003      Asia      56.5      0.393       0.0509  346.0      25.9
            2004      Asia      57.1      0.409       0.0368  336.0      26.1
            2005      Asia      57.6      0.418       0.0515  360.0      26.5
            2006      Asia      58.0      0.429       0.0622  368.0      26.9

                 life_exp_category
country     year
Afghanistan 2002              High
            2003              High
            2004              High
            2005              High
            2006              High

In [71]:
df.groupby("continent")["country"].nunique()

continent
Africa           51
Asia             47
Europe           39
North America    19
Oceania           8
South America    11
Name: country, dtype: int64

In [72]:
df.groupby("continent")["country"].count()

continent
Africa           1071
Asia              986
Europe            819
North America     399
Oceania           168
South America     231
Name: country, dtype: int64

In [74]:
df.sort_values("life_exp", ascending=False)

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services,life_exp_category
1700,Japan,Asia,2018,84.8,0.917,9.1400,36200.0,72.1,High
2918,Singapore,Asia,2018,84.7,0.936,7.1000,61100.0,84.0,High
2917,Singapore,Asia,2017,84.7,0.933,7.1100,59300.0,83.5,High
1699,Japan,Asia,2017,84.7,0.915,9.3300,35900.0,71.9,High
1698,Japan,Asia,2016,84.5,0.912,9.4500,35300.0,71.8,High
...,...,...,...,...,...,...,...,...,...
631,Central African Republic,Africa,1999,43.8,0.323,0.0742,483.0,16.2,Low
632,Central African Republic,Africa,2000,43.8,0.325,0.0735,460.0,16.3,Low
1099,Eswatini,Africa,2005,43.3,0.456,1.0000,2900.0,54.8,Low
1098,Eswatini,Africa,2004,43.1,0.445,1.0100,2750.0,54.0,Low
1419,Haiti,North America,2010,32.5,0.471,0.2110,1290.0,59.9,Low

In [75]:
df.sort_values(["life_exp", "year"])

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services,life_exp_category
1419,Haiti,North America,2010,32.5,0.471,0.2110,1290.0,59.9,Low
1098,Eswatini,Africa,2004,43.1,0.445,1.0100,2750.0,54.0,Low
1099,Eswatini,Africa,2005,43.3,0.456,1.0000,2900.0,54.8,Low
630,Central African Republic,Africa,1998,43.8,0.320,0.0717,477.0,16.0,Low
631,Central African Republic,Africa,1999,43.8,0.323,0.0742,483.0,16.2,Low
...,...,...,...,...,...,...,...,...,...
1698,Japan,Asia,2016,84.5,0.912,9.4500,35300.0,71.8,High
1699,Japan,Asia,2017,84.7,0.915,9.3300,35900.0,71.9,High
2917,Singapore,Asia,2017,84.7,0.933,7.1100,59300.0,83.5,High
2918,Singapore,Asia,2018,84.7,0.936,7.1000,61100.0,84.0,High
1700,Japan,Asia,2018,84.8,0.917,9.1400,36200.0,72.1,High

In [76]:
df.sort_values(["year", "life_exp"])

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services,life_exp_category
630,Central African Republic,Africa,1998,43.8,0.320,0.0717,477.0,16.00,Low
525,Burundi,Africa,1998,43.9,0.294,0.0403,322.0,5.59,Low
1995,Malawi,Africa,1998,45.5,0.395,0.0874,297.0,12.70,Low
3633,Zambia,Africa,1998,45.5,0.416,0.2310,751.0,23.00,Low
420,Botswana,Africa,1998,47.6,0.580,2.1200,4340.0,57.00,Low
...,...,...,...,...,...,...,...,...,...
3212,Switzerland,Europe,2018,83.9,0.955,4.3300,88000.0,76.50,High
1511,Iceland,Europe,2018,84.0,0.946,10.8000,57700.0,79.20,High
1469,"Hong Kong, China",Asia,2018,84.3,0.946,5.8600,45300.0,88.50,High
2918,Singapore,Asia,2018,84.7,0.936,7.1000,61100.0,84.00,High
1700,Japan,Asia,2018,84.8,0.917,9.1400,36200.0,72.10,High

In [77]:
### Creating a dataframe

In [ ]:
# Ways to create a DataFrame:
# 1. Row oriented approach
# 2. Column oriented approach

In [78]:
pd.DataFrame([[10,20], [30, 40]], columns=["A", "B"])

    A   B
0  10  20
1  30  40

In [79]:
a=pd.DataFrame([[10,20], [30, 40]], columns=["A", "B"])
b=pd.DataFrame([[10,20], [30, 40]], columns=["A", "B"])

In [80]:
pd.concat([a,b])

    A   B
0  10  20
1  30  40
0  10  20
1  30  40

In [81]:
a=pd.DataFrame([[10,20], [30, 40]], columns=["A", "B"])
b=pd.DataFrame([[10,20], [30, 40]], columns=["A", "C"])
pd.concat([a,b])

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [82]:
a=pd.DataFrame([[10,20], [30, 40]], columns=["A", "B"])
b=pd.DataFrame([[10,20], [30, 40]], columns=["A", "C"])
pd.concat([a,b], axis=1)

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [83]:
import pandas as pd

# Example DataFrames
df1 = pd.DataFrame({
    "country": ["Afghanistan", "Brazil"],
    "year": [2000, 2000],
    "life_exp": [54.7, 70.5]
})

df2 = pd.DataFrame({
    "country": ["Afghanistan", "Brazil"],
    "year": [2001, 2001],
    "life_exp": [54.8, 71.0]
})

# Vertical concatenation (stack rows)
df_vertical = pd.concat([df1, df2], ignore_index=True)
print("Vertical Concat:")
print(df_vertical)

# Horizontal concatenation (join columns) - Ensure same index alignment or use keys
df_horizontal = pd.concat([df1, df2], axis=1)
print("\nHorizontal Concat:")
print(df_horizontal)

Vertical Concat:
       country  year  life_exp
0  Afghanistan  2000      54.7
1       Brazil  2000      70.5
2  Afghanistan  2001      54.8
3       Brazil  2001      71.0

Horizontal Concat:
       country  year  life_exp      country  year  life_exp
0  Afghanistan  2000      54.7  Afghanistan  2001      54.8
1       Brazil  2000      70.5       Brazil  2001      71.0

In [84]:
# Create two DataFrames with a common key 'country'
df_left = pd.DataFrame({
    "country": ["Afghanistan", "Brazil", "China"],
    "continent": ["Asia", "South America", "Asia"]
})
df_right = pd.DataFrame({
    "country": ["Afghanistan", "Brazil", "Germany"],
    "gdp": [400, 2000, 3500]
})

# Merge using an inner join (only rows with matching countries)
merged_inner = pd.merge(df_left, df_right, on="country", how="inner")
print("\nInner Merge:")
print(merged_inner)

# Merge using an outer join (all rows from both DataFrames)
merged_outer = pd.merge(df_left, df_right, on="country", how="outer")
print("\nOuter Merge:")
print(merged_outer)

Inner Merge:
       country      continent   gdp
0  Afghanistan           Asia   400
1       Brazil  South America  2000

Outer Merge:
       country      continent     gdp
0  Afghanistan           Asia   400.0
1       Brazil  South America  2000.0
2        China           Asia     NaN
3      Germany            NaN  3500.0

In [88]:
df.groupby("continent")["country"].unique()

continent
Africa           [Algeria, Angola, Benin, Botswana, Burkina Fas...
Asia             [Afghanistan, Armenia, Azerbaijan, Bahrain, Ba...
Europe           [Albania, Austria, Belarus, Belgium, Bosnia an...
North America    [Bahamas, Barbados, Belize, Canada, Costa Rica...
Oceania          [Australia, Fiji, New Zealand, Papua New Guine...
South America    [Argentina, Bolivia, Brazil, Chile, Colombia, ...
Name: country, dtype: object

In [89]:
continent_ser = df.groupby("continent")["country"].unique()

In [90]:
con = continent_ser.index
val = continent_ser.values

pd.DataFrame({"Cnotinent": con, "country": val})

       Cnotinent                                            country
0         Africa  [Algeria, Angola, Benin, Botswana, Burkina Fas...
1           Asia  [Afghanistan, Armenia, Azerbaijan, Bahrain, Ba...
2         Europe  [Albania, Austria, Belarus, Belgium, Bosnia an...
3  North America  [Bahamas, Barbados, Belize, Canada, Costa Rica...
4        Oceania  [Australia, Fiji, New Zealand, Papua New Guine...
5  South America  [Argentina, Bolivia, Brazil, Chile, Colombia, ...